/*
 * 本文件是用来保存所有全局变量的
 * 我们称最顶上的栏为导航栏
 * 用tag描述导航栏上的标签
 * 第几个tag表示当前tag在所有tag中的排位（包括未显示的）
 * 相对第几个tag表示相对导航栏最左边tag的排位
 *
 */
var cluster1;
var typeid; //当前选中类
var nowhome = "tmphome"; //为了增加fade in效果，需要切换两个版面内容，该变量记录当前版面标签，取值为("tmphome", "home")
var maxpage; //tag的最大编号,注意这里是以0开头的，故一共有maxpage + 1个tag
var maxtag = 10;//导航栏中最多能显示多少个tag
var nowid = 0; //记录当前选中的tag是第几个tag，取值范围为 [0, maxpage]
var nowpage = 0; //记录当前导航栏中最左边的tag是第几个tag
var info_list = []; //记录第几个tag中显示的信息，以写成html格式的String保存
var name_list = ["0000000000000000","1000000000000000","2000000000000000","3000000000000000","4000000000000000","5000000000000000","6000000000000000","7000000000000000","8000000000000000","9000000000000000","10000000000000000","11000000000000000","12000000000000000","13000000000000000","14000000000000000","15000000000000000","16000000000000000","17000000000000000","18000000000000000","19000000000000000","20000000000000000", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36"];
var cluster_list = ["购物网站", "交通旅游", "行业企业", "教育文化", "生活服务", "体育健身", "网络科技", "新闻媒体", "休闲娱乐", "医疗健康", "政府组织", "综合其他", "未分类"];

//记录所有tag的title

/*
 * 记录每个tag里面包含了哪些url
 * 类型为[[History_Object]]
 * 即为一个list，包含了所有tag的url信息，每个tag的信息用一个list来记录，表示当前tag所包含的所有url
 * 注：测试方便起见，url信息用chrome默认提供的格式，关于次数需要后续添加
 */

var url_list = [];
